Proposal_2Ed.org
#+TITLE: Proposal of changes for a second edition of "Displaying Time Series, Spatial, and Space-Time Data with R"
#+AUTHOR: Oscar Perpiñán Lamigueiro
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage{mathpazo}
#+LATEX_HEADER: \usepackage[usenames,svgnames,dvipsnames]{xcolor}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=Blue, urlcolor=Blue}


* Interactive graphics

In the last two years several R packages devoted to interactive graphics have been published. The =htmlwidgets= package is the framework for creating R bindings to popular JavaScript libraries. In the context of the book these are the more interesting packages:

- =leaflet= (spatial data): https://rstudio.github.io/leaflet/ (/"Leaflet is a JavaScript library for creating dynamic maps that support panning and zooming along with various annotations like markers, polygons, and popups."/)
- =mapview= (spatial data): http://environmentalinformatics-marburg.github.io/mapview/introduction.html (/"mapview was created o fill the gap of quick (not presentation grade) interactive plotting to examine and visually investigate spatial data"/)
- =dygraphs= (time series): http://rstudio.github.io/dygraphs/ (/"Dygraphs provides rich facilities for charting time-series data in R and includes support for many interactive features including series/point highlighting, zooming, and panning."/)
- =highcharter= (time series and maps): http://jkunst.com/highcharter/
- =streamgraph= (time series with stacked graphs): http://hrbrmstr.github.io/streamgraph/


Most of the examples of interactive graphics included in the book make use of the =gridSVG= package. Unfortunately this package is not of common usage nowadays and their authors are not adding new features to it. Therefore, I will rewrite these examples with the new packages.

* New features in the =sp= package
The =sp= package includes in the recent versions (https://cran.r-project.org/web/packages/sp/news.html) new features that should be covered in the book:
- A new function =panel.ggmap=: Figure 8.4 (Air Madrid example) will be modified to use it.
- A new class SpatialMultipoints (an unique feature can be represented with multiple locations): A new section will be included to display these objects.

On the other hand, Edzer Pebesma, author of =sp=, has recently published the =sf= package, implementing Simple Features for R (https://cran.r-project.org/package=sf). The visualization methods included in this package are still in development, but I think it is interesting to devote an example to this package.

* Improvements
- Add introductory sections with easier examples to show the basics of the most important packages and functions.

- Additional section devoted to the =rgl= package (http://rgl.neoscientists.org/about.shtml) using the Earth's city lights imagery (http://visibleearth.nasa.gov/view.php?id=55167) in the code, maybe including an interactive example with the =rglwidget= package (http://www.htmlwidgets.org/showcase_rglwidget.html)

- Alternative method for the figure 3.9 (calendar plot) using =ggplot2= based on this post https://mvuorre.github.io/post/2016/2016-03-24-github-waffle-plot/

- The "Bivariate Choropleth Maps: A How-to Guide" is an useful resource to improve the section 8.2.3 http://www.joshuastevens.net/cartography/make-a-bivariate-choropleth-map/

* Bug fixes

- Make animated plots code from Chapter 13 portable (https://github.com/oscarperpinan/spacetime-vis/pull/6)
- Fix URLs for brazilAdm and brazilDEM datasets (https://github.com/oscarperpinan/spacetime-vis/pull/3)
- Fix URLs for Galicia DEM datasets (https://github.com/oscarperpinan/spacetime-vis/issues/5)
